---
kind: method
id: M:Autodesk.Revit.DB.Part.ResetPartShape
source: html/9cedb531-7e03-ae4d-53d8-4561dbbb7f23.htm
---
# Autodesk.Revit.DB.Part.ResetPartShape Method

Resets all face offsets applied to part faces.

## Syntax (C#)
```csharp
public void ResetPartShape()
```